views/persona/_form.php

SELECT * FROM `tipo_doc`
SELECT * FROM `pais_procedencia`
SELECT * FROM `institucion`
SELECT * FROM `tipo_persona`
---

    <?= $form->field($model, 'codigo_qr')->fileInput() ?>

    <?= $form->field($model, 'tipo_doc_idtipo_doc')->dropDownList(
        ArrayHelper::map(TipoDoc::find()->all(),'idtipo_doc','tipo_documento'),
        ['prompt'=>'Seleccione documento']
    ) ?>

    <?= $form->field($model, 'pais_procedencia_idpais_procedencia')->dropDownList(
        ArrayHelper::map(PaisProcedencia::find()->all(),'idpais_procedencia','nombre'),
        ['prompt'=>'Seleccione país']
    ) ?>

    <?= $form->field($model, 'institucion_idinstitucion')->dropDownList(
        ArrayHelper::map(Institucion::find()->all(),'idinstitucion','nombre'),
        ['prompt'=>'Seleccione institución']
    ) ?>

    <?= $form->field($model, 'tipo_persona_idtipo_persona')->dropDownList(
        ArrayHelper::map(TipoPersona::find()->all(),'idtipo_persona','tipo_persona'),
        ['prompt'=>'Seleccione persona']
    ) ?>