views/evento/_form.php

SELECT * FROM `tipo_evento`
---

    <?= $form->field($model, 'descripcion')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'tipo_evento_idtipo_evento')->dropDownList(
        ArrayHelper::map(TipoEvento::find()->all(),'idtipo_evento','tipo_evento'),
        ['prompt'=>'Seleccione tipo de evento']
    ) ?>

SELECT * FROM `tipo_area`
---
        ['prompt'=>'Seleccione CCM']
    ) ?>

    <?= $form->field($model, 'tipo_area_idtipo_area')->dropDownList(
        ArrayHelper::map(TipoArea::find()->all(),'idtipo_area','tipo_area'),
        ['prompt'=>'Seleccione Tipo de Área']
    ) ?>