views/persona-evento/_form.php

SELECT * FROM `evento`
SELECT * FROM `persona`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'evento_idevento')->dropDownList(
        ArrayHelper::map(Evento::find()->all(),'idevento','nombre'),
        ['prompt'=>'Seleccione Evento']
    ) ?>

    <?= $form->field($model, 'persona_idpersona')->dropDownList(
        ArrayHelper::map(Persona::find()->all(),'docPersona','documentoNombre'),
        ['prompt'=>'Seleccione Persona']
    ) ?>